# YOLOv11-M Custom Model
nc: 4       # number of classes
imgsz: 640  # image size

# ---------------------------------------
# BACKBONE
# ---------------------------------------
backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]

  - [-1, 1, SPPF, [512, 5]]

# ---------------------------------------
# NECK
# ---------------------------------------
neck:
  - [-1, 1, Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256, False]]

  - [-1, 1, Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, C2f, [128, False]]

# ---------------------------------------
# HEAD
# ---------------------------------------
head:
  - [[4, 6, 7], 1, Detect, [4]]   # nc = 4
